import time

work = True #Работа кода
w = 0
c = 0
n = 0
m = 60

print("Добро пожаловать в Таймер Помадоро")
print("Он поможет сконцентрироваться в работе")

while work == True:
    print("Выберите режим работы:")
    print("""1. Классический (25 мин. - работа; 5 мин. - отдых)
2. 50 мин. - работа; 10 мин. - отдых
3. 75 мин. - работа; 15 мин. - отдых
4. 100 мин. - работа; 25 мин. - отдых
""")
    
    v1 = int(input())
    n = int(input("Введите кол-во циклов (повторений): "))
    
    if v1 == 1:
        w = 25 * m
        c = 5 * m
    elif v1 == 2:
        w = 50 * m
        c = 10 * m
    elif v1 == 3:
        w = 75 * m
        c = 15 * m
    elif v1 == 4:
        w = 100 * m
        c = 20 * m
    
    for i in range(0, n, 1):
        print("Работайте", w/60, "минут")
        time.sleep(w)
        print("Отдыхайте", c/60 , " минут")
        time.sleep(w)
    
    print("Время концентрации окончено")

    print("Продолжить работу?: ")
    exit = input("1. Да"
    " 2. Нет ")

    if exit == "1":
        work = True
    else: 
        work = False
        print("До встречи! Продуктивного дня!")
